# 3-3) 입력함수1
# 당신의 이름은 무엇입니까?를 입력하고 출력해보자
# name = input("당신의 이름은 무엇입니까? : ")
# print("당신의 이름은 " + name + " 입니다")

# 3-4) 입력함수2
# 이름을 입력하고 이름의 길이를 알아보자
# > 간혹 이름의 길이가 영어일때 매우 길 경우가 있어서 입력창을 얼마나 길게 만들어야 할지, 데이터의 크기를 어떻게 할지 고민해야 하기 때문이다.

# print(len(input("당신의 이름은 무엇입니까?")))

# !--- 3일차 종합 챌린지 퀴즈 : 내가 좋아하는 영화를 입력하고, 영화의 주인공을 입력해서
# 내가 좋아하는 영화는 000이고, 주인공은 000다를 출력하세요.
# (정답은 게시판에)

movie = input("좋아하는 영화 : ")
actor = input("주인공 이름 : ")
print("좋아하는 영화는 " +movie+" 이고 주인공 이름은 "+actor+ "입니다.")